# ApparentCurrentPhaseA Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..ApparentCurrentPhaseA Property
ElectricalSystem Class See Also
---
The ApparentCurrentPhaseA value of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double ApparentCurrentPhaseA { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ApparentCurrentPhaseA As Double
	Get
```

Visual C++
---
```text
public:
property double ApparentCurrentPhaseA {
	double get ();
}
```

# Remarks
This property is used to retrieve the ApparentCurrentPhaseA value of the Electrical System.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This property only available when System Type is Power! |

# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace